Examples/dispersionPaper/Foam/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;

x1 0;
x2 .0000400;

y1 0;
y2 .0000400;

z1 0;
z2 .0000400;

velocity volumeAveraged;
pressureDrop momentumSource;
